#Использовать asserts
#Использовать ".."
#Использовать "../src/internal"

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПроверитьФормированиеВМСЗаданнымПубличнымАдресом");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьФормированиеВМСДинамическимПубличнымАдресом");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьФормированиеВМБезПубличногоАДреса");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьФормированиеВМЧерезФайл");
	Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Функция ПолучитьБазовыеПараметрыДляТеста(ВиртуальнаяМашинаYC)
	
	ПараметрыВМ = ВиртуальнаяМашинаYC.ПараметрыНовой();
	КлючАвторизации = ПараметрыВМ["КлючАвторизации"];
	КлючАвторизации["ПутьКФайлу"] = "metadataLinux.yaml";
	ПараметрыВМ["ЗонаДоступности"] = "ru-central1-a";
	ПараметрыВМ["ОбъемОперативнойПамятиГБ"] = 4;
	ПараметрыВМ["КоличествоЯдер"] = 4;
	ПараметрыВМ["ГарантированнаяДоляПроцессора"] = 5;
	ПараметрыВМ["Прерываемая"] = Истина;
	ПараметрыЖесткогоДиска = ПараметрыВМ["ЗагрузочныйДиск"];
	ПараметрыЖесткогоДиска["ИмяДиска"] = "bootdisk";
	ПараметрыЖесткогоДиска["ТипДиска"] = ТипыДисковYC.HDD();
	ПараметрыЖесткогоДиска["ОбъемГб"] = 10;
	ПараметрыЖесткогоДиска["ИмяСтандартногоОбраза"] = "redmine";
	ПараметрыВМ.Вставить("ЗагрузочныйДиск", ПараметрыЖесткогоДиска);
	ПараметрыВиртуальнойСети = ПараметрыВМ["ВиртуальнаяСеть"];
	ПараметрыВиртуальнойСети["ИмяСети"] = "default-ru-central1-a";
	ПараметрыВиртуальнойСети["IPv4Адрес"] = "10.128.0.10";
	ПараметрыВиртуальнойСети["ИспользоватьДинамическийIP"] = Ложь;
	ПараметрыВиртуальнойСети["ПубличныйСтатическийIP"] = "";

	Возврат ПараметрыВМ;

КонецФункции

Процедура ТестДолжен_ПроверитьФормированиеВМСЗаданнымПубличнымАдресом() Экспорт

	ВиртуальнаяМашинаYC = Новый ВиртуальнаяМашинаYC("redmine");
	ПараметрыВМ = ПолучитьБазовыеПараметрыДляТеста(ВиртуальнаяМашинаYC);
	ПараметрыВМ["ВиртуальнаяСеть"]["ИспользоватьДинамическийIP"] = Истина;
	ПараметрыВМ["ВиртуальнаяСеть"]["ПубличныйСтатическийIP"] = "130.193.39.49";
	
	ЗаготовкаКоманды = "yc compute instance create --no-user-output --format json --name redmine --metadata-from-file user-data=metadataLinux.yaml --zone ru-central1-a --memory 4 --cores 4 --core-fraction 5 --preemptible --create-boot-disk name=bootdisk,type=network-hdd,size=10,image-folder-id=standard-images,image-family=redmine --network-interface subnet-name=default-ru-central1-a,address=10.128.0.10,nat-address=130.193.39.49";
	
	Команда = РаботаСКомандами.СформироватьКомандуСозданияВМ(ВиртуальнаяМашинаYC.Имя(), ПараметрыВМ);
	Ожидаем.Что(
		Команда,
		"Ожидаем, что команда будут выполнимой"
	).Равно(ЗаготовкаКоманды);

КонецПроцедуры

Процедура ТестДолжен_ПроверитьФормированиеВМСДинамическимПубличнымАдресом() Экспорт
	
	ВиртуальнаяМашинаYC = Новый ВиртуальнаяМашинаYC("redmine");
	ПараметрыВМ = ПолучитьБазовыеПараметрыДляТеста(ВиртуальнаяМашинаYC);
	ПараметрыВМ["ВиртуальнаяСеть"]["ИспользоватьДинамическийIP"] = Истина;
	
	ЗаготовкаКоманды = "yc compute instance create --no-user-output --format json --name redmine --metadata-from-file user-data=metadataLinux.yaml --zone ru-central1-a --memory 4 --cores 4 --core-fraction 5 --preemptible --create-boot-disk name=bootdisk,type=network-hdd,size=10,image-folder-id=standard-images,image-family=redmine --network-interface subnet-name=default-ru-central1-a,address=10.128.0.10,nat-ip-version=ipv4";
	
	Команда = РаботаСКомандами.СформироватьКомандуСозданияВМ(ВиртуальнаяМашинаYC.Имя(), ПараметрыВМ);
	Ожидаем.Что(
		Команда,
		"Ожидаем, что команда будут выполнимой"
	).Равно(ЗаготовкаКоманды);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьФормированиеВМБезПубличногоАДреса() Экспорт
	
	ВиртуальнаяМашинаYC = Новый ВиртуальнаяМашинаYC("redmine");
	ПараметрыВМ = ПолучитьБазовыеПараметрыДляТеста(ВиртуальнаяМашинаYC);
	ПараметрыВМ["ВиртуальнаяСеть"]["ИспользоватьДинамическийIP"] = Ложь;
	ПараметрыВМ["ВиртуальнаяСеть"]["ПубличныйСтатическийIP"] = "130.193.39.49";
	
	ЗаготовкаКоманды = "yc compute instance create --no-user-output --format json --name redmine --metadata-from-file user-data=metadataLinux.yaml --zone ru-central1-a --memory 4 --cores 4 --core-fraction 5 --preemptible --create-boot-disk name=bootdisk,type=network-hdd,size=10,image-folder-id=standard-images,image-family=redmine --network-interface subnet-name=default-ru-central1-a,address=10.128.0.10,nat-address=130.193.39.49";
	
	Команда = РаботаСКомандами.СформироватьКомандуСозданияВМ(ВиртуальнаяМашинаYC.Имя(), ПараметрыВМ);

	Ожидаем.Что(
		Команда,
		"Ожидаем, что команда будут выполнимой"
	).Равно(ЗаготовкаКоманды);
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьФормированиеВМЧерезФайл() Экспорт
	
	ВиртуальнаяМашинаYC = Новый ВиртуальнаяМашинаYC("redmine");
	
	ЗаготовкаКоманды = "yc compute instance create --no-user-output --format json --name redmine --metadata-from-file user-data=metadataLinux.yaml --zone ru-central1-a --memory 4 --cores 2 --core-fraction 5 --preemptible --create-boot-disk name=bootdisk,type=network-hdd,size=10,image-folder-id=standard-images,image-family=ubuntu-1804 --network-interface subnet-name=default-ru-central1-a,address=10.128.0.10,nat-ip-version=ipv4";
	
	Команда = РаботаСКомандами.СформироватьКомандуСозданияВМ(ВиртуальнаяМашинаYC.Имя(), "./yacloud/tests/linux.xml");

	Ожидаем.Что(
		Команда,
		"Ожидаем, что команда будут выполнимой"
	).Равно(ЗаготовкаКоманды);
	
КонецПроцедуры