#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	ВсеТесты = Новый Массив;
	ВсеТесты.Добавить("ТестДолжен_ПрочитатьТокен");
	Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Процедура ТестДолжен_ПрочитатьТокен() Экспорт
	
	ДлинаСтрокиТокена = СтрДлина(ПодключениеYC.ПрочитатьOAuthTken("OAuthToken"));
	Ожидаем.Что(
		ДлинаСтрокиТокена,
		"Ожидаем, что длина токена будет соответствовать 39 занакам"
	).Равно(39);
	
КонецПроцедуры